public/quickie/2021/22-10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-23 Sat 16:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>With clauses in Elixir</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sigu Magwa" />
<link rel="stylesheet" type="text/css" href="../../../css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">With clauses in Elixir</h1>

<div id="outline-container-orgf69c1df" class="outline-3">
<h3 id="orgf69c1df">How it works</h3>
<div class="outline-text-3" id="text-orgf69c1df">
<p>
Have a look at the with clause shown below, it has two matches that must pass
</p>
<ol class="org-ol">
<li><code>func_ok()</code> must return <code>:ok</code></li>
<li><code>func_error()</code> must return <code>:error</code></li>
</ol>

<p>
It will then invoke the <code>do</code> <code>end</code> block that is  <code>IO.puts "printed"</code> only if the two conditions above are met
</p>
<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">:ok</span> &lt;- func_ok<span style="color: #4f97d7;">()</span>, <span style="color: #4f97d7;">:error</span> &lt;- func_error<span style="color: #4f97d7;">()</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  <span style="color: #ce537a; font-weight: bold;">IO</span>.puts <span style="color: #2d9574;">"printed"</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
This is useful when for example you want to ensure the following conditions are met
</p>
<ol class="org-ol">
<li>user is logged in</li>
<li>the promo code entered is still valid</li>
<li>the user is not blacklisted</li>
<li>the item you are applying the promo code to can accept the discounts</li>
</ol>

<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">:ok</span> &lt;- login_user<span style="color: #4f97d7;">()</span>,
     <span style="color: #4f97d7;">:valid</span> &lt;- check_promo_code<span style="color: #4f97d7;">()</span>,
       <span style="color: #4f97d7;">:ok</span> &lt;- user_not_blacklisted<span style="color: #4f97d7;">()</span>,
       <span style="color: #4f97d7;">:ok</span> &lt;- item_on_promo<span style="color: #4f97d7;">()</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  apply_promo_code<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>


<p>
A cool thing, you can assign variables too
</p>
<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">:ok</span> &lt;- <span style="color: #4f97d7;">:ok</span>, <span style="color: #4f97d7;">:error</span> &lt;- <span style="color: #4f97d7;">:error</span>, <span style="color: #7590db;">ans</span> = <span style="color: #a45bad;">3</span> + <span style="color: #a45bad;">4</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  <span style="color: #ce537a; font-weight: bold;">IO</span>.puts ans
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-orgcd0281f" class="outline-3">
<h3 id="orgcd0281f">It stops checking immediately a check fails</h3>
<div class="outline-text-3" id="text-orgcd0281f">
<p>
If in the process of executing the functions, one of then does not return the expected result, then the unmatching result is returned. For example,
</p>

<p>
If <code>func_ok()</code> below returned <code>{:error, :unauthorised}</code> then the <code>func_error()</code> will not be executed and the return value of the with clause will be
<code>{:error, :unauthorised}</code>
</p>
<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">:ok</span> &lt;- func_ok<span style="color: #4f97d7;">()</span>, <span style="color: #4f97d7;">:error</span> &lt;- func_error<span style="color: #4f97d7;">()</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  <span style="color: #ce537a; font-weight: bold;">IO</span>.puts <span style="color: #2d9574;">"printed"</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9554c91" class="outline-3">
<h3 id="org9554c91">you can match failing clauses</h3>
<div class="outline-text-3" id="text-org9554c91">
<p>
if you do not want to return the failing return value then you can pattern match on the return value and have a custom return. This introduces the else block
</p>
<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">:ok</span> &lt;- func_ok<span style="color: #4f97d7;">()</span>, <span style="color: #4f97d7;">:error</span> &lt;- func_error<span style="color: #4f97d7;">()</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  <span style="color: #ce537a; font-weight: bold;">IO</span>.puts <span style="color: #2d9574;">"printed"</span>
  <span style="color: #4f97d7; font-weight: bold;">else</span>
    <span style="color: #4f97d7;">{</span><span style="color: #4f97d7;">:error</span>, <span style="color: #4f97d7;">:unauthorised</span><span style="color: #4f97d7;">}</span> -&gt; <span style="color: #2d9574;">"Custom return value"</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
This time round if the <code>func_ok()</code> returns <code>{:error, :unauthorised}</code> it will be pattern matched on the else block.
</p>

<p>
What do you think will happen if <code>func_error()</code> returns <code>:ok</code>? It will actually blow up, why? Its because  you have to match all the possible return values of all the expressions in the with block.
So how can you make it work as expected? Add a second pattern on the else block 😄
</p>
</div>
</div>

<div id="outline-container-orgf6ed431" class="outline-2">
<h2 id="orgf6ed431">Resources</h2>
<div class="outline-text-2" id="text-orgf6ed431">
<ul class="org-ul">
<li><a href="https://hexdocs.pm/elixir/Kernel.SpecialForms.html#with/1">https://hexdocs.pm/elixir/Kernel.SpecialForms.html#with/1</a></li>
<li><a href="https://elixir-lang.org/getting-started/mix-otp/docs-tests-and-with.html#with">https://elixir-lang.org/getting-started/mix-otp/docs-tests-and-with.html#with</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sigu Magwa</p>
<p class="date">Created: 2021-10-23 Sat 16:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
